numbers = [5, 2 ,7]
#numbers[3] = 100
numbers.append(100) #метод додавання в список додаткових данних
numbers.insert(1, True) #вставка данних в список перед указаним за нумерацією елементом

b = [5, 7, 8]
numbers.extend([5, 7, 8]) # вставка групи данних в список в кінець

#b = [5, 7, 8]
numbers.extend(b) #теж саме що і вище тільки за допомогою перемінної з власним списком
#numbers.sort() #для сортування елементів в певному порядку
#numbers.reverse() #для розвороту всіх елементів

#numbers.pop() #видалення останнього елементу в списку або з уточненням індексу
#numbers.remove(5) #видалення вказаного елементу
#numbers.clear() #повне видалення всіх елементів

#print(numbers)
#print(numbers.count(5)) #рахує кількість вказаних елементів в списку
print(len(numbers)) #рахує кількість елементів в списку
