# a=int(input())
# V=a**3
# S=6*(a**2)
# print(f"Объем = {V}\n"f"Площадь полной поверхности = {S}")

# [print("Обьем = ", i**3 ,"\n" , "Площадь полной поверхности = ", i**2*6,sep="")for i in [int(input())]]

# __________________________________________________________________________________________________
# def F(a,b):
#     return((3*((a+b)**3)+(275*(b**2))-(127*a)-41))
# print(F(int(input()),(int(input()))))

# __________________________________________________________________________________
# a=int(input())
# print(f"Следующее за числом {a} число: {a + 1}\n",f"Для числа {a} предыдущее число: {a - 1}",sep="")

# _____________________________________________________________________________________________________'
# count=0
# result=0
# while count!=4:
#     result+=int(input())
#     count+=1
# print(result*3)
# _______________________________________________________

# a, b = int(input()), int(input())
# print(f"{a} + {b} = {a + b}",f"{a} - {b} = {a - b}",f"{a} * {b} = {a * b}" ,sep="")

i=int(input())
# print(i,i*2,i*3,i*4,i*5,sep="---")
print(*[i*x for x in range(1,6)],sep="---")



