#Frozenset - це список без повторюваних елементів
#data = set('hello')
data = {5, 6, 7, 3 , 5}  #без ключів вказані занчення = множество , з ключами = словарь
data.add(32) # додавння одного елементу
data.update(['True' , 3, 6 , 3.5 , False]) #додавання великої кількостіелементів
data.remove(False) #видалення вказаного елемента
#data.pop() #видалення першого елементу списка
data.clear() #видалення всіх елементів
print(data)  #вивід данних

nums = [5 , 6 , 7 , 3 , 2 , 5 , 2 , 6 ]
new_nums = set(nums)
#Frozenset це той самий список без повторюваних елементів та й на додачу що не можна редагувати
new_data = frozenset([5, 6, 7, 3 , 5 , 'True' , 3, 6 , 3.5 , False])

#new_data.add  - не працює бо як і кортежи не можна редагувати фрозенсет

print(new_data)